In [7]:
import pandas as pd

In [ ]:
'''
Adding
* df["new_column"] = value or list/array --> adds a new column to the DataFrame with the specified value or list/array
* df.insert(loc, 'new_column', value) --> inserts a new column at the specified location (loc) in the DataFrame
* df['new_column'] = df['existing_column'] * 2 --> creates a new column by performing operations on existing columns

'''

In [8]:
Data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 24, 35, 32],
    'City': ['New York', 'Paris', 'Berlin', 'London']
}
df = pd.DataFrame(Data)
print("Original DataFrame :\n", df)
df["salary"] = [50000, 60000, 55000, 65000]  # Adding a new column 'salary'
print("\nnew dataframe :\n",df)

df["bonus_salary"] = df['salary'] + df['salary'] * 0.1
print("\nnew dataframe after bonus salary:\n",df)

df.insert(2, 'Country', ['USA', 'France', 'Germany', 'UK'])  # Inserting a new column 'Country' at index 2
print("\nnew dataframe after inserting country:\n",df)

Original DataFrame :
     Name  Age      City
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

new dataframe :
     Name  Age      City  salary
0   John   28  New York   50000
1   Anna   24     Paris   60000
2  Peter   35    Berlin   55000
3  Linda   32    London   65000

new dataframe after bonus salary:
     Name  Age      City  salary  bonus_salary
0   John   28  New York   50000       55000.0
1   Anna   24     Paris   60000       66000.0
2  Peter   35    Berlin   55000       60500.0
3  Linda   32    London   65000       71500.0

new dataframe after inserting country:
     Name  Age  Country      City  salary  bonus_salary
0   John   28      USA  New York   50000       55000.0
1   Anna   24   France     Paris   60000       66000.0
2  Peter   35  Germany    Berlin   55000       60500.0
3  Linda   32       UK    London   65000       71500.0

In [ ]:
'''
Updating or modifying a column
* df.loc[index, 'column_name'] = new_value --> updates the value at the specified index for the given column
* df['column_name'] = df['column_name'] * 2 (or any other operation) --> modifies the entire column based on an operation

'''

In [13]:
print("DataFrame before modification:\n\n",df)
df.loc[1, 'Age'] = 25  # Updating the age of Anna to 25
print("\nDataFrame after modification:\n\n",df)

DataFrame before modification:

     Name  Age  Country      City  salary  bonus_salary
0   John   28      USA  New York   50000       55000.0
1   Anna   24   France     Paris   60000       66000.0
2  Peter   35  Germany    Berlin   55000       60500.0
3  Linda   32       UK    London   65000       71500.0

DataFrame after modification:

     Name  Age  Country      City  salary  bonus_salary
0   John   28      USA  New York   50000       55000.0
1   Anna   25   France     Paris   60000       66000.0
2  Peter   35  Germany    Berlin   55000       60500.0
3  Linda   32       UK    London   65000       71500.0

In [14]:
df['salary'] = df['salary'] * 1.05  # Increasing all salaries by 5%
print("\nDataFrame after increasing salaries by 5%:\n\n",df)

DataFrame after increasing salaries by 5%:

     Name  Age  Country      City   salary  bonus_salary
0   John   28      USA  New York  52500.0       55000.0
1   Anna   25   France     Paris  63000.0       66000.0
2  Peter   35  Germany    Berlin  57750.0       60500.0
3  Linda   32       UK    London  68250.0       71500.0

In [ ]:
''' 
Removing
* df.drop(columns =[column_name], inplace=True) --> removes the specified column from the DataFrame, inplace=True modifies the original DataFrame else returns a new DataFrame

'''

In [32]:
print("\nColumns in DataFrame:\n", df.columns)
df['bonus_salary'] = [5000, 6600, 6050, 7150]
print("\nDataFrame before dropping 'bonus_salary' column:\n\n",df)
df.drop(columns=['bonus_salary'], inplace=True)  # Removing the 'bonus_salary' column permanently
print("\n\nafter the deletion of bonus_salary:\n\n",df)

Columns in DataFrame:
 Index(['Name', 'Age', 'Country', 'City', 'salary'], dtype='object')

DataFrame before dropping 'bonus_salary' column:

     Name  Age  Country      City   salary  bonus_salary
0   John   28      USA  New York  52500.0          5000
1   Anna   25   France     Paris  63000.0          6600
2  Peter   35  Germany    Berlin  57750.0          6050
3  Linda   32       UK    London  68250.0          7150


after the deletion of bonus_salary:

     Name  Age  Country      City   salary
0   John   28      USA  New York  52500.0
1   Anna   25   France     Paris  63000.0
2  Peter   35  Germany    Berlin  57750.0
3  Linda   32       UK    London  68250.0